Revit 2027 API
STEPExportOptions Class
 The export options used by exporting STEP format file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BIMExportOptions
 Autodesk.Revit.DB.STEPExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class STEPExportOptions : BIMExportOptions
Public Class STEPExportOptions
	Inherits BIMExportOptions
public ref class STEPExportOptions : public BIMExportOptions
type STEPExportOptions =
    class
        inherit BIMExportOptions
    end
The STEPExportOptions type exposes the following members.
Constructors
Name | Description
STEPExportOptions |  Constructs a new instance of STEPExportOptions with default values of all properties.
Top
Properties
Name | Description
ApplicationProtocol |  The Application Protocol of the exported STEP file.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from BIMExportOptions)
TargetUnit |  The unit type of geometry in the resultant STEP file. Default value is ExportUnit::Default.
ViewId |  The element id of the 3D view to export. InvalidElementId by default.
(Inherited from BIMExportOptions)
Top
Methods
Name | Description
Dispose
(Inherited from BIMExportOptions)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace